(package! org-super-agenda)
(package! org-fragtog)
(package! org-appear :recipe (:host github :repo "awth13/org-appear"))
(package! org-ol-tree :recipe (:host github :repo "Townk/org-ol-tree"))
(package! laas :recipe (:host github :repo "tecosaur/LaTeX-auto-activating-snippets"))
(package! org-roam-ui :recipe (:host github :repo "org-roam/org-roam-ui" :files ("*.el" "out")))
(package! websocket)
(package! doct :recipe (:host github :repo "progfolio/doct"))
(package! consult-org-roam :recipe (:host github :repo "jgru/consult-org-roam"))
(package! elpher)
(package! elfeed-protocol)
(package! guess-language)
(unpin! doom-themes)
(package! stimmung-themes :recipe (:host github :repo "motform/stimmung-themes"))
